# 기계에 해당하는 하드웨어가 있고, 앱에 해당하는 소프트웨어가 있다.
# 하드웨어:전자 기계 장치-컴퓨터의 장치나 부품.하드 뜻이 단단하다.라고 해서 우리가 만질 수 있는 것이라고 생각하면 쉽다.하지만 하드웨어 하나만으로는 빈 깡통 하나와 비슷해서 소프트 웨어가 있어야 하드웨어도 움직일 수 있다.
# 소프트웨어:하드웨어를 작동시키는 프로그램
# 하드웨어와소프트웨어도 인간과 점점 비슷해 지고 있다.(예:인공지능로봇)
# 하드웨어 개발자와소프트웨어 개발자가 있다.소프트웨어 개발자는 프로그래머라고도 부른다.
# 소프트웨어 종류:윈도우 마크,EBS,e학습터,youtube,naver,Daum,카카오톡,틱톡,브롤스타즈,카트라이더등등이 있다.
# 소프트웨어는 컴퓨터나 핸드폰에만 있는 것 이 아니다.(예:냉장고,TV,세탁기,디지털 피아노,에어컨등등)
# 앱은 프로그래밍 언어로 만든다.절대 한국어 영어등언어가 아니고,Python,C,C++,Java,Go등등같이 코딩을 하는 프로그램이다.
# 프로그래밍 언어:컴퓨터와 의사소통하기 위해 인간이 만든 문자 언어.프로그래밍 언어가 조금식 생겨 날 때마다 인간의 언어와 비슷해져 간다.
# 프로그래밍 언어 종류:C,C++,Java,Python,Java,JavaScript,Go,Swift,Korlin등등이 있다.
# C,C++은 프로그래밍 언어의 조상이다.최상의 성능을 필요로 하는 곳에 주로 사용 된다.C,C++으로는 대부분 응용 프로그램을 만든다.
# Java는 응용프로그램~모바일등을 사용.사용범위가 넓음.복잡하지만 장점이 많다.
# Python는 C,C++,Java에서 하던 서비스를 쉽게 구현 했다.그리고 AI, 빅데이타에 많이 사용된다.
# JavaScript는 웹 프로그래밍을 하는 언어이다.
# Go는 Google에서 만든 언어고, 클라우드에 사용한다.
# Swift는 아이폰의 앱 스토어에서 파는 앱을 만들 수 있다.
# Kotlin은 안드로이드,갤럭시폰등에서 사용된다.
# 언어별 용도가 다르다.
# 언어별 사용되는 분야는 훨씬 다양하다.
# 한 프로젝트에 여러 언어를 사용한다.