# 자료형(데이타 타입) (예:100,3.5,'라이언',True)이러한 데이타 종류를 자료형이라고 한다.
# Python 자료형 = (숫자:int 데이타:10,-3등등,float 데이타:3.5,0.05등등),(문자:str(string의 줄임말)(주의:문자는''또는""로 묶어주어야 한다.숫자도 따옴표로 묶으면 문자가 된다.) 데이타:'라이언','Hello등등)(부울:bool(참과거짓을 나타냄) 데이타:True,False)
name = '전정국' # 이름
rope = 200 # 줄넘기 횟수
rope_time = 90 # 90초
rope_pass = True # 통과 했는 가?

print(name,rope,rope_time,rope_pass)

# 자료형(데이타 타입)에서 많은 것을 가질 수 있는 것:(list(정말많이 사용딘다.(대가로로 묶여있음) 데이타:[1,2,3,4,5]등등,turple(소가로로 묶여있음) 데이타:(1,2,3,4,5)등등,set(중가로로 묶여있음) 데이타:{1,2,3,4,5}등등,dict(dictionary의 줄임말이고,중가로로 묶여있으며,문자형이다.){'사과':'빨강','바나나':'노랑'})

rope = 56
day = 23.5
rain = False
mycountry = '대한민국'
rainbowlist = ['빨','주','노','초','파','남','보']