if 4 in [1,2,3,4,5]:
    print('있다')
else:
    print("없다")
# 파이썬은 1991년(한32년 쯤 전) 귀도 반 로섬(Guido van Rossum)이 개발한 인터프리터 언어이다.
# 파이썬은 귀도 반 로섬이 옛날 때 본 <Monty Python's Flying Circus>에서 이름을 따왔다.
# 또 파이썬은 귀도 반 로섬이 크리스마스 휴가 때 취미로 개발한 프로그래밍 언어다. 
# Python = 비단뱀(한국어로) 이유:파이썬의 로고가 비단뱀 처럼 생겨서다.옛날에는 파이썬 책에 뱀그림이 많았다.(표지에)
# 파이썬이 쉬운 이유:기본적인 영어 아는 사람이라면 이해가 가능하다.
# 파이썬:파이썬은 스크래치와 다르게 소스코드를 직접 작성해야 한다.
# 빅데이타:세상의 수많은 데이타의 분석과 활용(예:유투브 추천 동영상)하지만 빅데이타는 유투브 추천 동영상의 범위보다 어마무시하게 넓다.문자,그림,사운드 같은 데이타 뿐만 아니라 사람의 행동,취향 등의 정보까지 분석한다.
# 인공지능 알파고가 바둑으로 이세돌 9단과 대결했다. 결과는 